Revit 2027 API
RadialArray.GetNumberOfMembersIncludingPlaceholders Method
 Returns the number of items in an array, including placeholder items in families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfMembersIncludingPlaceholders()
Public Function GetNumberOfMembersIncludingPlaceholders As Integer
public:
int GetNumberOfMembersIncludingPlaceholders()
member GetNumberOfMembersIncludingPlaceholders : unit -> int
Return Value
Int32
 The number of elements in an array, including placeholder items in families.
Remarks
 To find the number of placeholder elements in a family, subtract the value of the NumMembers property from this value.
See Also
Reference
RadialArray Class
Autodesk.Revit.DB Namespace